---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeSegment.GetConstraints
source: html/87dd3a6a-97e8-6b89-7ac9-b495d109996b.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeSegment.GetConstraints Method

Retrieve the list of constraints associated with this segment.

## Syntax (C#)
```csharp
public IList<RebarShapeConstraint> GetConstraints()
```

## Returns
The list of constraints.